artillery/test.yml
config:
  target: "https://api.weatherstack.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Steady Load Phase

  payload:
    path: "./payload.json"
    fields:
      - access_key
      - query
      - units
    json: true # Specifies that the payload is a JSON file

  headers:
    Content-Type: "application/json"

  ensure:
    - "http.response_time.p95 < 800"
    - "http.response_time.mean < 500"
    - "http.requests > 100"

scenarios:
  - name: Weather API Testing
    flow:
      - get:
          url: "/current"
          query:
            access_key: "{{ access_key }}"
            query: "New York"
            units: "m"

      - post:
          url: "/current"
          json:
            access_key: "{{ access_key }}"
            query: "{{ query }}"
            units: "{{ units }}"