artillery/test.yml
config:
  target: "https://api.weatherstack.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Steady Load Phase

  headers:
    Content-Type: "application/json"

  ensure:
    - "http.response_time.p95 < 800"
    - "http.response_time.mean < 500"
    - "http.requests > 100"

scenarios:
  - name: Weather API Testing
    flow:
      - get:
          url: "/current"
          query:
            access_key: "YOUR_ACCESS_KEY"
            query: "New York"
            units: "m"

      - post:
          url: "/current"
          json:
            access_key: "YOUR_ACCESS_KEY" 
            query: "London"
            units: "m"